
INSERT INTO Department
    (Id,Name)
VALUES
    ('02', 'Công nghệ thông tin')

GO

INSERT INTO Lecturer
    (Id,Name ,Phone,Email,DepartmentId)
VALUES
    ('1223', N'Trịnh Thị Nhị', '0978606526', 'nhittcntt@gmail.com', '02'),
    ('1222', N'Ngô Thanh Huyền', '0982713518', 'nthuyenster@gmail.com', '02'),
    ('1242', N'Trần Đỗ Thu Hà', '0976289988', 'tdhapi@gmail.com' , '02' ),
    ('1235', N'Nguyễn Hoàng Điệp', '0987862348', 'Diep82003@gmail.com' , '02' ),
    ('1246', N'Đỗ Thị Thu Trang', '0912100248', 'TrangLexus@gmail.com', '02' ),
    ('1248', N'Nguyễn Minh Tiến', '0983860318', 'Minhtienhy@gmail.com' , '02' ),
    ('1683', N'Trần Thanh Tùng', '0984112299', 'tungnhunghy@gmail.com' , '02' ),
    ('1232', N'Vũ Xuân Thắng', '0988169829', 'xuanthangutehy@gmail.com' , '02' ),
    ('1394', N'Ngô Thị Lan Anh', '0972479668', 'ntlananh.utehy@gmail.com' , '02' ),
    ('1240', N'Nguyễn Thị Thanh Huệ', '0979851509', 'huentt1509@gmail.com', '02' ),
    ('1226', N'Nguyễn Đình Chiến', '0962836394', 'chienql@gmail.com' , '02' ),
    ('1231', N'Trần Thị Phương', '0975822600', 'Phuongutehy2405@gmail.com', '02' ),
    ('1011', N'Bùi Đức Thọ', '0868363969', 'buithok3@gmail.com' , '02' ),
    ('1241', N'Vũ Huy Thế', '0978823873', 'thevh.bn@gmail.com', '02' ),
    ('1215', N'Phạm Minh Chuẩn', '0983081120', 'chuanpm@gmail.com' , '02' ),
    ('1216', N'Nguyễn Vinh Quy', '0367122505', 'vinhquynguyen@gmail.com'  , '02' ),
    ('1243', N'Vi Hoài Nam', '0944879789', 'vihoainam@gmail.com' , '02' ),
    ('1228', N'Phạm Quốc Hùng', '0983360925', 'quochungvnu@gmail.com' , '02' ),
    ('1218', N'Nguyễn Văn Quyết', '0912188636', 'quyetict@gmail.com', '02' ),
    ('1229', N'Đào Anh Hiển', '0983264436', 'hienda@gmail.com' , '02' ),
    ('1693', N'Vũ Thị Kim Ngân', '0867799839', 'vunganart@gmail.com'  , '02' ),
    ('1689', N'Đặng Việt Hưng', '0966348117', 'dangviethung1107@gmail.com' , '02' ),
    ('1617', N'Đào Mạnh Linh', '0948869911', 'daomanhlink@gmail.com' , '02' ),
    ('1704', N'Phạm Thị Hà Linh', '0987852638', 'phamthihalinh@gmail.com' , '02' ),
    ('1236', N'Hoàng Quốc Việt', '0976124669', 'viethqict@gmail.com', '02' ),
    ('1221', N'Nguyễn Hữu Đông', '0983539745', 'dongcntt77@gmail.com', '02' ),
    ('1225', N'Nguyễn Duy Tân', '0972947808', 'tanndhyvn@gmail.com', '02');
-- ('1225', N'Chu Bá Thành', '0901582882', 'thanhcb.dce@gmail.com'  , '02' ),


GO

INSERT INTO Class
    (Id,Name , FormTeacherId, DepartmentId)
VALUES
    ('125201', '', '1223', '02'),
    ('125202', '', '1222', '02'),
    ('125203', '', '1222', '02'),
    ('125204', '', '1242', '02'),
    ('125205', '', '1235', '02'),
    ('125206', '', '1246', '02'),
    ('124201', '', '1248', '02'),
    ('101201', '', '1683', '02'),
    ('101202', '', '1232', '02'),
    ('101203', '', '1394', '02'),
    ('101204', '', '1225', '02'),
    ('101205', '', '1240', '02'),
    ('10120TN', '', '1226', '02'),
    ('125211', '', '1232', '02'),
    ('125212', '', '1231', '02'),
    ('125213', '', '1231', '02'),
    ('125214', '', '1011', '02'),
    ('125215', '', '1011', '02'),
    ('125216', '', '1246', '02'),
    ('125217', '', '1223', '02'),
    ('124211', '', '1241', '02'),
    ('12421TN', '', '1215', '02'),
    ('101211', '', '1216', '02'),
    ('101212', '', '1243', '02'),
    ('101213', '', '1394', '02'),
    ('101214', '', '1228', '02'),
    ('101215', '', '1240', '02'),
    ('101216', '', '1216', '02'),
    ('12522W.1', '', '1232', '02'),
    ('12522W.2', '', '1231', '02'),
    ('12522W.3', '', '1242', '02'),
    ('12522W.4', '', '1218', '02'),
    ('12522T.1', '', '1229', '02'),
    ('124221', '', '1241', '02'),
    ('12422TN', '', '1215', '02'),
    ('10122N.1', '', '1243', '02'),
    ('10122G.1', '', '1693', '02'),
    ('10122G.2', '', '1693', '02'),
    ('10122G.3', '', '1689', '02'),
    ('10122G.4', '', '1689', '02'),
    ('101231', '', '1225', '02'),
    ('101232', '', '1228', '02'),
    ('101233', '', '1617', '02'),
    ('101234', '', '1704', '02'),
    ('101235', '', '1226', '02'),
    ('125231', '', '1236', '02'),
    ('125232', '', '1221', '02'),
    ('125233', '', '1222', '02'),
    ('12423TN', '', '1215', '02'),
    ('124231', '', '1241', '02'),
    ('125234', '', '1235', '02');

GO

INSERT INTO AssistantDean
    (LecturerId,DepartmentId)
VALUES
    ('1215', '02')

DELETE FROM Course
DELETE FROM Student